/*Од тастатура се читаат 2 позитивни цели броеви. Доколку се внесе барем еден негативен број или 0 треба да се печати „Invalid input“.

Треба да се определи дали помалиот број “е парен еквивалент” од поголемиот број.

Еден број “е парен еквивалент” на друг број, ако и само ако неговите цифри се наоѓаат на парните позиции од другиот број, во истиот редослед.
 Соодветно да се испечатат пораки „PAREN“ и „NE“.

Позициите треба да се сметаат оддесно-налево (најмалку значајната цифра е на позиција 1)
*/
#include <iostream>
using namespace std;
int main()
{
    int a,b;
    cin>>a>>b;
    if(a>0||b>0)
    {
        cout<<"Invalid Output:"<<endl;
    }
  
    if (a<b)
    {
        int tmp=a;
        a=b;
        b=tmp;
    }
    while (b!=0)
    {
        if (a%100/10==b%10)
        {
            a/=100;
            b/=10;
            continue;
        }
        cout<<"NE"<<endl;
        return 0;
    }
    cout<<"PAREN"<<endl;
       return 0;
}